espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/plugin/level-control/level-control.c
  if (zcl_decode_level_control_cluster_move_to_level_command(cmd, &cmd_data)
      != EMBER_ZCL_STATUS_SUCCESS) {
    return false;
  }

  emberAfLevelControlClusterPrintln("%pMOVE_TO_LEVEL %x %2x %x %x",
                                    "RX level-control:",
                                    cmd_data.level,
                                    cmd_data.transitionTime,
                                    cmd_data.optionMask,
                                    cmd_data.optionOverride);
  moveToLevelHandler(ZCL_MOVE_TO_LEVEL_COMMAND_ID,
                     cmd_data.level,
                     cmd_data.transitionTime,
                     cmd_data.optionMask,
                     cmd_data.optionOverride,
                     INVALID_STORED_LEVEL); // Don't revert to the stored level
  return true;
}

bool emberAfLevelControlClusterMoveToLevelWithOnOffCallback(EmberAfClusterCommand *cmd)
{
  sl_zcl_level_control_cluster_move_to_level_with_on_off_command_t cmd_data;

  if (zcl_decode_level_control_cluster_move_to_level_with_on_off_command(cmd, &cmd_data)
      != EMBER_ZCL_STATUS_SUCCESS) {
    return false;
  }

  emberAfLevelControlClusterPrintln("%pMOVE_TO_LEVEL_WITH_ON_OFF %x %2x",
                                    "RX level-control:",
                                    cmd_data.level,
                                    cmd_data.transitionTime);
  moveToLevelHandler(ZCL_MOVE_TO_LEVEL_WITH_ON_OFF_COMMAND_ID,
                     cmd_data.level,
                     cmd_data.transitionTime,
                     0xFF,
                     0xFF,
                     INVALID_STORED_LEVEL); // Don't revert to the stored level
  return true;
}

bool emberAfLevelControlClusterMoveCallback(EmberAfClusterCommand *cmd)
{
  sl_zcl_level_control_cluster_move_command_t cmd_data;

  if (zcl_decode_level_control_cluster_move_command(cmd, &cmd_data)
      != EMBER_ZCL_STATUS_SUCCESS) {
    return false;
  }

  emberAfLevelControlClusterPrintln("%pMOVE %x %x",
                                    "RX level-control:",
                                    cmd_data.moveMode,
                                    cmd_data.rate);
  moveHandler(ZCL_MOVE_COMMAND_ID, cmd_data.moveMode, cmd_data.rate, cmd_data.optionMask, cmd_data.optionOverride);
  return true;
}

bool emberAfLevelControlClusterMoveWithOnOffCallback(EmberAfClusterCommand *cmd)
{
  sl_zcl_level_control_cluster_move_with_on_off_command_t cmd_data;

  if (zcl_decode_level_control_cluster_move_with_on_off_command(cmd, &cmd_data)
      != EMBER_ZCL_STATUS_SUCCESS) {
    return false;
  }

  emberAfLevelControlClusterPrintln("%pMOVE_WITH_ON_OFF %x %x",
                                    "RX level-control:",
                                    cmd_data.moveMode,
                                    cmd_data.rate);
  moveHandler(ZCL_MOVE_WITH_ON_OFF_COMMAND_ID, cmd_data.moveMode, cmd_data.rate, 0xFF, 0xFF);
  return true;
}

bool emberAfLevelControlClusterStepCallback(EmberAfClusterCommand *cmd)
{
  sl_zcl_level_control_cluster_step_command_t cmd_data;

  if (zcl_decode_level_control_cluster_step_command(cmd, &cmd_data)
      != EMBER_ZCL_STATUS_SUCCESS) {
    return false;
  }

  emberAfLevelControlClusterPrintln("%pSTEP %x %x %2x",
                                    "RX level-control:",
                                    cmd_data.stepMode,
                                    cmd_data.stepSize,
                                    cmd_data.transitionTime);
  stepHandler(ZCL_STEP_COMMAND_ID, cmd_data.stepMode, cmd_data.stepSize, cmd_data.transitionTime, cmd_data.optionMask, cmd_data.optionOverride);
  return true;
}

bool emberAfLevelControlClusterStepWithOnOffCallback(EmberAfClusterCommand *cmd)
{
  sl_zcl_level_control_cluster_step_with_on_off_command_t cmd_data;

  if (zcl_decode_level_control_cluster_step_with_on_off_command(cmd, &cmd_data)
      != EMBER_ZCL_STATUS_SUCCESS) {
    return false;
  }

  emberAfLevelControlClusterPrintln("%pSTEP_WITH_ON_OFF %x %x %2x",
                                    "RX level-control:",
                                    cmd_data.stepMode,
                                    cmd_data.stepSize,
                                    cmd_data.transitionTime);
  stepHandler(ZCL_STEP_WITH_ON_OFF_COMMAND_ID,
              cmd_data.stepMode,
              cmd_data.stepSize,
              cmd_data.transitionTime,
              0xFF,
              0xFF);
  return true;
}

bool emberAfLevelControlClusterStopCallback(EmberAfClusterCommand *cmd)
{
  sl_zcl_level_control_cluster_stop_command_t cmd_data;

  if (zcl_decode_level_control_cluster_stop_command(cmd, &cmd_data)
      != EMBER_ZCL_STATUS_SUCCESS) {
    return false;
  }

  emberAfLevelControlClusterPrintln("%pSTOP", "RX level-control:");
  stopHandler(ZCL_STOP_COMMAND_ID, cmd_data.optionMask, cmd_data.optionOverride);
  return true;
}

bool emberAfLevelControlClusterStopWithOnOffCallback(void)
{
  emberAfLevelControlClusterPrintln("%pSTOP_WITH_ON_OFF", "RX level-control:");
  stopHandler(ZCL_STOP_WITH_ON_OFF_COMMAND_ID, 0xFF, 0xFF);
  return true;
}

#else // !UC_BUILD

bool emberAfLevelControlClusterMoveToLevelCallback(uint8_t level,
                                                   uint16_t transitionTime,
                                                   uint8_t optionMask,
                                                   uint8_t optionOverride)
{
  emberAfLevelControlClusterPrintln("%pMOVE_TO_LEVEL %x %2x %x %x",
                                    "RX level-control:",
                                    level,
                                    transitionTime,
                                    optionMask,
                                    optionOverride);
  moveToLevelHandler(ZCL_MOVE_TO_LEVEL_COMMAND_ID,
                     level,
                     transitionTime,
                     optionMask,
                     optionOverride,
                     INVALID_STORED_LEVEL); // Don't revert to the stored level
  return true;
}

bool emberAfLevelControlClusterMoveToLevelWithOnOffCallback(uint8_t level,
                                                            uint16_t transitionTime)
{
  emberAfLevelControlClusterPrintln("%pMOVE_TO_LEVEL_WITH_ON_OFF %x %2x",
                                    "RX level-control:",
                                    level,
                                    transitionTime);
  moveToLevelHandler(ZCL_MOVE_TO_LEVEL_WITH_ON_OFF_COMMAND_ID,
                     level,
                     transitionTime,
                     0xFF,
                     0xFF,
                     INVALID_STORED_LEVEL); // Don't revert to the stored level
  return true;
}

bool emberAfLevelControlClusterMoveCallback(uint8_t moveMode,
                                            uint8_t rate,
                                            uint8_t optionMask,
                                            uint8_t optionOverride)
{
  emberAfLevelControlClusterPrintln("%pMOVE %x %x",
                                    "RX level-control:",
                                    moveMode,
                                    rate);
  moveHandler(ZCL_MOVE_COMMAND_ID, moveMode, rate, optionMask, optionOverride);
  return true;
}

bool emberAfLevelControlClusterMoveWithOnOffCallback(uint8_t moveMode, uint8_t rate)
{
  emberAfLevelControlClusterPrintln("%pMOVE_WITH_ON_OFF %x %x",
                                    "RX level-control:",
                                    moveMode,
                                    rate);
  moveHandler(ZCL_MOVE_WITH_ON_OFF_COMMAND_ID, moveMode, rate, 0xFF, 0xFF);
  return true;
}

bool emberAfLevelControlClusterStepCallback(uint8_t stepMode,
                                            uint8_t stepSize,
                                            uint16_t transitionTime,
                                            uint8_t optionMask,
                                            uint8_t optionOverride)
{
  emberAfLevelControlClusterPrintln("%pSTEP %x %x %2x",
                                    "RX level-control:",
                                    stepMode,
                                    stepSize,
                                    transitionTime);
  stepHandler(ZCL_STEP_COMMAND_ID, stepMode, stepSize, transitionTime, optionMask, optionOverride);
  return true;
}

bool emberAfLevelControlClusterStepWithOnOffCallback(uint8_t stepMode,
                                                     uint8_t stepSize,
                                                     uint16_t transitionTime)
{
  emberAfLevelControlClusterPrintln("%pSTEP_WITH_ON_OFF %x %x %2x",
                                    "RX level-control:",
                                    stepMode,
                                    stepSize,
                                    transitionTime);
  stepHandler(ZCL_STEP_WITH_ON_OFF_COMMAND_ID,
              stepMode,
              stepSize,
              transitionTime,
              0xFF,
              0xFF);
  return true;
}

bool emberAfLevelControlClusterStopCallback(uint8_t optionMask,
                                            uint8_t optionOverride)
{
  emberAfLevelControlClusterPrintln("%pSTOP", "RX level-control:");
  stopHandler(ZCL_STOP_COMMAND_ID, optionMask, optionOverride);
  return true;
}

bool emberAfLevelControlClusterStopWithOnOffCallback(void)
{
  emberAfLevelControlClusterPrintln("%pSTOP_WITH_ON_OFF", "RX level-control:");
  stopHandler(ZCL_STOP_WITH_ON_OFF_COMMAND_ID, 0xFF, 0xFF);
  return true;
}

#endif // !UC_BUILD

static void moveToLevelHandler(uint8_t commandId,
                               uint8_t level,
                               uint16_t transitionTimeDs,
                               uint8_t optionMask,
                               uint8_t optionOverride,
                               uint16_t storedLevel)
{
  uint8_t endpoint = emberAfCurrentEndpoint();
  EmberAfLevelControlState *state = getState(endpoint);
  EmberAfStatus status;
  uint8_t currentLevel;
  uint8_t actualStepSize;

  if (state == NULL) {
    status = EMBER_ZCL_STATUS_FAILURE;
    goto send_default_response;
  }

  if (!shouldExecuteIfOff(endpoint, commandId, optionMask, optionOverride)) {
    status = EMBER_ZCL_STATUS_SUCCESS;
    goto send_default_response;
  }

  // Cancel any currently active command before fiddling with the state.
  deactivate(endpoint);

  status = emberAfReadServerAttribute(endpoint,
                                      ZCL_LEVEL_CONTROL_CLUSTER_ID,
                                      ZCL_CURRENT_LEVEL_ATTRIBUTE_ID,
                                      (uint8_t *)&currentLevel,
                                      sizeof(currentLevel));
  if (status != EMBER_ZCL_STATUS_SUCCESS) {
    emberAfLevelControlClusterPrintln("ERR: reading current level %x", status);
    goto send_default_response;
  }

  state->commandId = commandId;

  // Move To Level commands cause the device to move from its current level to
  // the specified level at the specified rate.
  SL_IGNORE_TYPE_LIMIT_BEGIN;
  if (MAX_LEVEL < level) {
    state->moveToLevel = MAX_LEVEL;
  } else if (level < MIN_LEVEL) {
    state->moveToLevel = MIN_LEVEL;
  } else {
    state->moveToLevel = level;
  }
  SL_IGNORE_TYPE_LIMIT_END;

  // If the level is decreasing, the On/Off attribute is left unchanged.  This
  // logic is to prevent a light from transitioning from off to bright to dim.
  // Instead, a light that is off will stay off until the target level is
  // reached.
  if (currentLevel <= state->moveToLevel) {
    if (commandId == ZCL_MOVE_TO_LEVEL_WITH_ON_OFF_COMMAND_ID) {
      setOnOffValue(endpoint, (state->moveToLevel != MIN_LEVEL));
    }
    if (currentLevel == state->moveToLevel) {
      status = EMBER_ZCL_STATUS_SUCCESS;
      goto send_default_response;
    }
    state->increasing = true;
    actualStepSize = state->moveToLevel - currentLevel;
  } else {
    state->increasing = false;
    actualStepSize = currentLevel - state->moveToLevel;
  }

