espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/plugin/level-control/level-control.c
#ifdef ZCL_USING_LEVEL_CONTROL_CLUSTER_START_UP_CURRENT_LEVEL_ATTRIBUTE
static bool areStartUpLevelControlServerAttributesTokenized(uint8_t endpoint)
{
  EmberAfAttributeMetadata *metadata;

  metadata = emberAfLocateAttributeMetadata(endpoint,
                                            ZCL_LEVEL_CONTROL_CLUSTER_ID,
                                            ZCL_CURRENT_LEVEL_ATTRIBUTE_ID,
                                            CLUSTER_MASK_SERVER,
                                            EMBER_AF_NULL_MANUFACTURER_CODE);
  if (!emberAfAttributeIsTokenized(metadata)) {
    return false;
  }

  metadata = emberAfLocateAttributeMetadata(endpoint,
                                            ZCL_LEVEL_CONTROL_CLUSTER_ID,
                                            ZCL_START_UP_CURRENT_LEVEL_ATTRIBUTE_ID,
                                            CLUSTER_MASK_SERVER,
                                            EMBER_AF_NULL_MANUFACTURER_CODE);
  if (!emberAfAttributeIsTokenized(metadata)) {
    return false;
  }

  return true;
}
#endif

#ifdef UC_BUILD

uint32_t emberAfLevelControlClusterServerCommandParse(sl_service_opcode_t opcode,
                                                      sl_service_function_context_t *context)
{
  (void)opcode;

  EmberAfClusterCommand *cmd = (EmberAfClusterCommand *)context->data;
  bool wasHandled = false;

  if (!cmd->mfgSpecific) {
    switch (cmd->commandId) {
      case ZCL_MOVE_TO_LEVEL_COMMAND_ID:
      {
        wasHandled = emberAfLevelControlClusterMoveToLevelCallback(cmd);
        break;
      }
      case ZCL_MOVE_COMMAND_ID:
      {
        wasHandled = emberAfLevelControlClusterMoveCallback(cmd);
        break;
      }
      case ZCL_STEP_COMMAND_ID:
      {
        wasHandled = emberAfLevelControlClusterStepCallback(cmd);
        break;
      }
      case ZCL_STOP_COMMAND_ID:
      {
        wasHandled = emberAfLevelControlClusterStopCallback(cmd);
        break;
      }
      case ZCL_MOVE_TO_LEVEL_WITH_ON_OFF_COMMAND_ID:
      {
        wasHandled = emberAfLevelControlClusterMoveToLevelWithOnOffCallback(cmd);
        break;
      }
      case ZCL_MOVE_WITH_ON_OFF_COMMAND_ID:
      {
        wasHandled = emberAfLevelControlClusterMoveWithOnOffCallback(cmd);
        break;
      }
      case ZCL_STEP_WITH_ON_OFF_COMMAND_ID:
      {
        wasHandled = emberAfLevelControlClusterStepWithOnOffCallback(cmd);
        break;
      }
      case ZCL_STOP_WITH_ON_OFF_COMMAND_ID:
      {
        wasHandled = emberAfLevelControlClusterStopWithOnOffCallback();
        break;
      }
    }
  }

  return ((wasHandled)
          ? EMBER_ZCL_STATUS_SUCCESS
          : EMBER_ZCL_STATUS_UNSUP_COMMAND);
}

#endif // UC_BUILD
